{"modelTopology":{"class_name":"Model","config":{"name":"model17","layers":[{"name":"input17","class_name":"InputLayer","config":{"batch_input_shape":[null,20,16],"dtype":"float32","sparse":false,"name":"input17"},"inbound_nodes":[]},{"name":"lstm_LSTM81","class_name":"LSTM","config":{"name":"lstm_LSTM81","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["input17",0,0,{}]]]},{"name":"lstm_LSTM82","class_name":"LSTM","config":{"name":"lstm_LSTM82","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false},"inbound_nodes":[[["input17",0,0,{}]]]},{"name":"concatenate_Concatenate33","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate33","trainable":true},"inbound_nodes":[[["lstm_LSTM81",0,0,{}],["lstm_LSTM82",0,0,{}]]]},{"name":"dense_Dense129","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense129","trainable":true},"inbound_nodes":[[["concatenate_Concatenate33",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization49","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization49","trainable":true},"inbound_nodes":[[["dense_Dense129",0,0,{}]]]},{"name":"dropout_Dropout49","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout49","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization49",0,0,{}]]]},{"name":"lstm_LSTM83","class_name":"LSTM","config":{"name":"lstm_LSTM83","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dropout_Dropout49",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization50","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization50","trainable":true},"inbound_nodes":[[["lstm_LSTM83",0,0,{}]]]},{"name":"add_Add33","class_name":"Add","config":{"name":"add_Add33","trainable":true},"inbound_nodes":[[["dropout_Dropout49",0,0,{}],["layer_normalization_LayerNormalization50",0,0,{}]]]},{"name":"dropout_Dropout50","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout50","trainable":true},"inbound_nodes":[[["add_Add33",0,0,{}]]]},{"name":"lstm_LSTM84","class_name":"LSTM","config":{"name":"lstm_LSTM84","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dropout_Dropout50",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization51","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization51","trainable":true},"inbound_nodes":[[["lstm_LSTM84",0,0,{}]]]},{"name":"add_Add34","class_name":"Add","config":{"name":"add_Add34","trainable":true},"inbound_nodes":[[["dropout_Dropout50",0,0,{}],["layer_normalization_LayerNormalization51",0,0,{}]]]},{"name":"dropout_Dropout51","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout51","trainable":true},"inbound_nodes":[[["add_Add34",0,0,{}]]]},{"name":"dense_Dense130","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense130","trainable":true},"inbound_nodes":[[["dropout_Dropout51",0,0,{}]]]},{"name":"dense_Dense132","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense132","trainable":true},"inbound_nodes":[[["dense_Dense130",0,0,{}]]]},{"name":"concatenate_Concatenate34","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate34","trainable":true},"inbound_nodes":[[["dropout_Dropout51",0,0,{}],["dense_Dense132",0,0,{}]]]},{"name":"dense_Dense133","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense133","trainable":true},"inbound_nodes":[[["concatenate_Concatenate34",0,0,{}]]]},{"name":"lstm_LSTM85","class_name":"LSTM","config":{"name":"lstm_LSTM85","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dense_Dense133",0,0,{}]]]},{"name":"dense_Dense134","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000025}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense134","trainable":true},"inbound_nodes":[[["lstm_LSTM85",0,0,{}]]]},{"name":"dense_Dense135","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000025}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense135","trainable":true},"inbound_nodes":[[["dense_Dense134",0,0,{}]]]},{"name":"dense_Dense136","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense136","trainable":true},"inbound_nodes":[[["dense_Dense135",0,0,{}]]]}],"input_layers":[["input17",0,0]],"output_layers":[["dense_Dense136",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM81/kernel","shape":[16,256],"dtype":"float32"},{"name":"lstm_LSTM81/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM81/bias","shape":[256],"dtype":"float32"},{"name":"lstm_LSTM82/kernel","shape":[16,256],"dtype":"float32"},{"name":"lstm_LSTM82/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM82/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense129/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense129/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization49/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization49/beta","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM83/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM83/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM83/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization50/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization50/beta","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM84/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM84/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM84/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization51/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization51/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense130/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense130/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense132/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense132/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense133/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense133/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM85/kernel","shape":[64,128],"dtype":"float32"},{"name":"lstm_LSTM85/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"lstm_LSTM85/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense134/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense134/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense135/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense135/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense136/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense136/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}