{"modelTopology":{"class_name":"Model","config":{"name":"model19","layers":[{"name":"input19","class_name":"InputLayer","config":{"batch_input_shape":[null,20,16],"dtype":"float32","sparse":false,"name":"input19"},"inbound_nodes":[]},{"name":"lstm_LSTM91","class_name":"LSTM","config":{"name":"lstm_LSTM91","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["input19",0,0,{}]]]},{"name":"lstm_LSTM92","class_name":"LSTM","config":{"name":"lstm_LSTM92","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false},"inbound_nodes":[[["input19",0,0,{}]]]},{"name":"concatenate_Concatenate37","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate37","trainable":true},"inbound_nodes":[[["lstm_LSTM91",0,0,{}],["lstm_LSTM92",0,0,{}]]]},{"name":"dense_Dense145","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense145","trainable":true},"inbound_nodes":[[["concatenate_Concatenate37",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization55","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization55","trainable":true},"inbound_nodes":[[["dense_Dense145",0,0,{}]]]},{"name":"dropout_Dropout55","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout55","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization55",0,0,{}]]]},{"name":"lstm_LSTM93","class_name":"LSTM","config":{"name":"lstm_LSTM93","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dropout_Dropout55",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization56","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization56","trainable":true},"inbound_nodes":[[["lstm_LSTM93",0,0,{}]]]},{"name":"add_Add37","class_name":"Add","config":{"name":"add_Add37","trainable":true},"inbound_nodes":[[["dropout_Dropout55",0,0,{}],["layer_normalization_LayerNormalization56",0,0,{}]]]},{"name":"dropout_Dropout56","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout56","trainable":true},"inbound_nodes":[[["add_Add37",0,0,{}]]]},{"name":"lstm_LSTM94","class_name":"LSTM","config":{"name":"lstm_LSTM94","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dropout_Dropout56",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization57","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization57","trainable":true},"inbound_nodes":[[["lstm_LSTM94",0,0,{}]]]},{"name":"add_Add38","class_name":"Add","config":{"name":"add_Add38","trainable":true},"inbound_nodes":[[["dropout_Dropout56",0,0,{}],["layer_normalization_LayerNormalization57",0,0,{}]]]},{"name":"dropout_Dropout57","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout57","trainable":true},"inbound_nodes":[[["add_Add38",0,0,{}]]]},{"name":"dense_Dense146","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense146","trainable":true},"inbound_nodes":[[["dropout_Dropout57",0,0,{}]]]},{"name":"dense_Dense148","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense148","trainable":true},"inbound_nodes":[[["dense_Dense146",0,0,{}]]]},{"name":"concatenate_Concatenate38","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate38","trainable":true},"inbound_nodes":[[["dropout_Dropout57",0,0,{}],["dense_Dense148",0,0,{}]]]},{"name":"dense_Dense149","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense149","trainable":true},"inbound_nodes":[[["concatenate_Concatenate38",0,0,{}]]]},{"name":"lstm_LSTM95","class_name":"LSTM","config":{"name":"lstm_LSTM95","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["dense_Dense149",0,0,{}]]]},{"name":"dense_Dense150","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":2.5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense150","trainable":true},"inbound_nodes":[[["lstm_LSTM95",0,0,{}]]]},{"name":"dense_Dense151","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":2.5e-7}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense151","trainable":true},"inbound_nodes":[[["dense_Dense150",0,0,{}]]]},{"name":"dense_Dense152","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense152","trainable":true},"inbound_nodes":[[["dense_Dense151",0,0,{}]]]}],"input_layers":[["input19",0,0]],"output_layers":[["dense_Dense152",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM91/kernel","shape":[16,256],"dtype":"float32"},{"name":"lstm_LSTM91/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM91/bias","shape":[256],"dtype":"float32"},{"name":"lstm_LSTM92/kernel","shape":[16,256],"dtype":"float32"},{"name":"lstm_LSTM92/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM92/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense145/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense145/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization55/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization55/beta","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM93/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM93/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM93/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization56/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization56/beta","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM94/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM94/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM94/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization57/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization57/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense146/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense146/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense148/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense148/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense149/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense149/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM95/kernel","shape":[64,128],"dtype":"float32"},{"name":"lstm_LSTM95/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"lstm_LSTM95/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense150/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense150/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense151/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense151/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense152/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense152/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}