{"modelTopology":{"class_name":"Model","config":{"name":"sequential_30_model","layers":[{"name":"layer_normalization_LayerNormalization175_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization175_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization175","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization175","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization175_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional59","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM59","trainable":true,"units":192,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional59","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization175",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization176","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization176","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional59",0,0,{}]]]},{"name":"dropout_Dropout146","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout146","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization176",0,0,{}]]]},{"name":"bidirectional_Bidirectional60","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM60","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional60","trainable":true},"inbound_nodes":[[["dropout_Dropout146",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization177","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization177","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional60",0,0,{}]]]},{"name":"dropout_Dropout147","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout147","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization177",0,0,{}]]]},{"name":"dense_Dense117","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense117","trainable":true},"inbound_nodes":[[["dropout_Dropout147",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization178","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization178","trainable":true},"inbound_nodes":[[["dense_Dense117",0,0,{}]]]},{"name":"dropout_Dropout148","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout148","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization178",0,0,{}]]]},{"name":"dense_Dense118","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense118","trainable":true},"inbound_nodes":[[["dropout_Dropout148",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization179","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization179","trainable":true},"inbound_nodes":[[["dense_Dense118",0,0,{}]]]},{"name":"dropout_Dropout149","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout149","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization179",0,0,{}]]]},{"name":"dense_Dense119","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense119","trainable":true},"inbound_nodes":[[["dropout_Dropout149",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization180","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization180","trainable":true},"inbound_nodes":[[["dense_Dense119",0,0,{}]]]},{"name":"dropout_Dropout150","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout150","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization180",0,0,{}]]]},{"name":"dense_Dense120","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense120","trainable":true},"inbound_nodes":[[["dropout_Dropout150",0,0,{}]]]},{"name":"activation_Activation30","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation30","trainable":true},"inbound_nodes":[[["dense_Dense120",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization175_input",0,0]],"output_layers":[["activation_Activation30",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization175/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization175/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/bias","shape":[768],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/bias","shape":[768],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization176/gamma","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization176/beta","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization177/gamma","shape":[96],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization177/beta","shape":[96],"dtype":"float32"},{"name":"dense_Dense117/kernel","shape":[96,64],"dtype":"float32"},{"name":"dense_Dense117/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization178/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization178/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense118/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense118/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization179/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization179/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense119/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense119/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization180/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization180/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense120/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}