{"modelTopology":{"class_name":"Model","config":{"name":"sequential_6_model","layers":[{"name":"layer_normalization_LayerNormalization31_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization31_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization31","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization31","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization31_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional11","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM11","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional11","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization31",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization32","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization32","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional11",0,0,{}]]]},{"name":"dropout_Dropout26","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout26","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization32",0,0,{}]]]},{"name":"bidirectional_Bidirectional12","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM12","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional12","trainable":true},"inbound_nodes":[[["dropout_Dropout26",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization33","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization33","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional12",0,0,{}]]]},{"name":"dropout_Dropout27","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout27","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization33",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["dropout_Dropout27",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization34","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization34","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}]]]},{"name":"dropout_Dropout28","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout28","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization34",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["dropout_Dropout28",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization35","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization35","trainable":true},"inbound_nodes":[[["dense_Dense22",0,0,{}]]]},{"name":"dropout_Dropout29","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout29","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization35",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["dropout_Dropout29",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization36","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization36","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]},{"name":"dropout_Dropout30","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout30","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization36",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["dropout_Dropout30",0,0,{}]]]},{"name":"activation_Activation6","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation6","trainable":true},"inbound_nodes":[[["dense_Dense24",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization31_input",0,0]],"output_layers":[["activation_Activation6",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization31/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization31/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/forward_lstm_LSTM11/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/forward_lstm_LSTM11/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/forward_lstm_LSTM11/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/backward_lstm_LSTM11/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/backward_lstm_LSTM11/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional11/backward_lstm_LSTM11/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization32/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization32/beta","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/forward_lstm_LSTM12/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/forward_lstm_LSTM12/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/forward_lstm_LSTM12/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/backward_lstm_LSTM12/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/backward_lstm_LSTM12/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional12/backward_lstm_LSTM12/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization33/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization33/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[32,64],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization34/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization34/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization35/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization35/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization36/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization36/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}