{"modelTopology":{"class_name":"Model","config":{"name":"sequential_30_model","layers":[{"name":"bidirectional_Bidirectional59_input","class_name":"InputLayer","config":{"batch_input_shape":[null,20,19],"dtype":"float32","sparse":false,"name":"bidirectional_Bidirectional59_input"},"inbound_nodes":[]},{"name":"bidirectional_Bidirectional59","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM59","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional59","trainable":true,"batch_input_shape":[null,20,19],"dtype":"float32"},"inbound_nodes":[[["bidirectional_Bidirectional59_input",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization59","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization59","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional59",0,0,{}]]]},{"name":"dropout_Dropout59","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout59","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization59",0,0,{}]]]},{"name":"bidirectional_Bidirectional60","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM60","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional60","trainable":true},"inbound_nodes":[[["dropout_Dropout59",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization60","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization60","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional60",0,0,{}]]]},{"name":"dropout_Dropout60","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout60","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization60",0,0,{}]]]},{"name":"dense_Dense88","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense88","trainable":true},"inbound_nodes":[[["dropout_Dropout60",0,0,{}]]]},{"name":"dense_Dense89","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense89","trainable":true},"inbound_nodes":[[["dense_Dense88",0,0,{}]]]},{"name":"dense_Dense90","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense90","trainable":true},"inbound_nodes":[[["dense_Dense89",0,0,{}]]]}],"input_layers":[["bidirectional_Bidirectional59_input",0,0]],"output_layers":[["dense_Dense90",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/kernel","shape":[19,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/forward_lstm_LSTM59/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/kernel","shape":[19,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional59/backward_lstm_LSTM59/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization59/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization59/beta","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/forward_lstm_LSTM60/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional60/backward_lstm_LSTM60/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization60/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization60/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense88/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense88/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense89/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense89/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense90/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense90/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}