{"modelTopology":{"class_name":"Model","config":{"name":"sequential_31_model","layers":[{"name":"layer_normalization_LayerNormalization181_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization181_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization181","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization181","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization181_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional61","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM61","trainable":true,"units":192,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional61","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization181",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization182","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization182","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional61",0,0,{}]]]},{"name":"dropout_Dropout151","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout151","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization182",0,0,{}]]]},{"name":"bidirectional_Bidirectional62","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM62","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional62","trainable":true},"inbound_nodes":[[["dropout_Dropout151",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization183","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization183","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional62",0,0,{}]]]},{"name":"dropout_Dropout152","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout152","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization183",0,0,{}]]]},{"name":"dense_Dense121","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense121","trainable":true},"inbound_nodes":[[["dropout_Dropout152",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization184","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization184","trainable":true},"inbound_nodes":[[["dense_Dense121",0,0,{}]]]},{"name":"dropout_Dropout153","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout153","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization184",0,0,{}]]]},{"name":"dense_Dense122","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense122","trainable":true},"inbound_nodes":[[["dropout_Dropout153",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization185","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization185","trainable":true},"inbound_nodes":[[["dense_Dense122",0,0,{}]]]},{"name":"dropout_Dropout154","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout154","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization185",0,0,{}]]]},{"name":"dense_Dense123","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense123","trainable":true},"inbound_nodes":[[["dropout_Dropout154",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization186","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization186","trainable":true},"inbound_nodes":[[["dense_Dense123",0,0,{}]]]},{"name":"dropout_Dropout155","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout155","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization186",0,0,{}]]]},{"name":"dense_Dense124","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense124","trainable":true},"inbound_nodes":[[["dropout_Dropout155",0,0,{}]]]},{"name":"activation_Activation31","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation31","trainable":true},"inbound_nodes":[[["dense_Dense124",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization181_input",0,0]],"output_layers":[["activation_Activation31",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization181/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization181/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/forward_lstm_LSTM61/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/forward_lstm_LSTM61/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/forward_lstm_LSTM61/bias","shape":[768],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/backward_lstm_LSTM61/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/backward_lstm_LSTM61/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional61/backward_lstm_LSTM61/bias","shape":[768],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization182/gamma","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization182/beta","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/forward_lstm_LSTM62/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/forward_lstm_LSTM62/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/forward_lstm_LSTM62/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/backward_lstm_LSTM62/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/backward_lstm_LSTM62/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional62/backward_lstm_LSTM62/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization183/gamma","shape":[96],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization183/beta","shape":[96],"dtype":"float32"},{"name":"dense_Dense121/kernel","shape":[96,64],"dtype":"float32"},{"name":"dense_Dense121/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization184/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization184/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense122/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense122/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization185/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization185/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense123/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense123/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization186/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization186/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense124/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense124/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}