{"modelTopology":{"class_name":"Model","config":{"name":"sequential_21_model","layers":[{"name":"layer_normalization_LayerNormalization121_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization121_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization121","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization121","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization121_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional41","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM41","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional41","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization121",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization122","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization122","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional41",0,0,{}]]]},{"name":"dropout_Dropout101","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout101","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization122",0,0,{}]]]},{"name":"bidirectional_Bidirectional42","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM42","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional42","trainable":true},"inbound_nodes":[[["dropout_Dropout101",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization123","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization123","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional42",0,0,{}]]]},{"name":"dropout_Dropout102","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout102","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization123",0,0,{}]]]},{"name":"dense_Dense81","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense81","trainable":true},"inbound_nodes":[[["dropout_Dropout102",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization124","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization124","trainable":true},"inbound_nodes":[[["dense_Dense81",0,0,{}]]]},{"name":"dropout_Dropout103","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout103","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization124",0,0,{}]]]},{"name":"dense_Dense82","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense82","trainable":true},"inbound_nodes":[[["dropout_Dropout103",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization125","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization125","trainable":true},"inbound_nodes":[[["dense_Dense82",0,0,{}]]]},{"name":"dropout_Dropout104","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout104","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization125",0,0,{}]]]},{"name":"dense_Dense83","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense83","trainable":true},"inbound_nodes":[[["dropout_Dropout104",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization126","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization126","trainable":true},"inbound_nodes":[[["dense_Dense83",0,0,{}]]]},{"name":"dropout_Dropout105","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout105","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization126",0,0,{}]]]},{"name":"dense_Dense84","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense84","trainable":true},"inbound_nodes":[[["dropout_Dropout105",0,0,{}]]]},{"name":"activation_Activation21","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation21","trainable":true},"inbound_nodes":[[["dense_Dense84",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization121_input",0,0]],"output_layers":[["activation_Activation21",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization121/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization121/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/forward_lstm_LSTM41/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/forward_lstm_LSTM41/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/forward_lstm_LSTM41/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/backward_lstm_LSTM41/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/backward_lstm_LSTM41/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional41/backward_lstm_LSTM41/bias","shape":[512],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization122/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization122/beta","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/forward_lstm_LSTM42/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/forward_lstm_LSTM42/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/forward_lstm_LSTM42/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/backward_lstm_LSTM42/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/backward_lstm_LSTM42/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional42/backward_lstm_LSTM42/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization123/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization123/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense81/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense81/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization124/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization124/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense82/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense82/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization125/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization125/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense83/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense83/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization126/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization126/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense84/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense84/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}