{"modelTopology":{"class_name":"Model","config":{"name":"sequential_12_model","layers":[{"name":"layer_normalization_LayerNormalization67_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization67_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization67","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization67","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization67_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional23","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM23","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional23","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization67",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization68","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization68","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional23",0,0,{}]]]},{"name":"dropout_Dropout56","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout56","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization68",0,0,{}]]]},{"name":"bidirectional_Bidirectional24","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM24","trainable":true,"units":48,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional24","trainable":true},"inbound_nodes":[[["dropout_Dropout56",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization69","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization69","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional24",0,0,{}]]]},{"name":"dropout_Dropout57","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout57","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization69",0,0,{}]]]},{"name":"dense_Dense45","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense45","trainable":true},"inbound_nodes":[[["dropout_Dropout57",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization70","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization70","trainable":true},"inbound_nodes":[[["dense_Dense45",0,0,{}]]]},{"name":"dropout_Dropout58","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout58","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization70",0,0,{}]]]},{"name":"dense_Dense46","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense46","trainable":true},"inbound_nodes":[[["dropout_Dropout58",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization71","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization71","trainable":true},"inbound_nodes":[[["dense_Dense46",0,0,{}]]]},{"name":"dropout_Dropout59","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout59","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization71",0,0,{}]]]},{"name":"dense_Dense47","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense47","trainable":true},"inbound_nodes":[[["dropout_Dropout59",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization72","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization72","trainable":true},"inbound_nodes":[[["dense_Dense47",0,0,{}]]]},{"name":"dropout_Dropout60","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout60","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization72",0,0,{}]]]},{"name":"dense_Dense48","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense48","trainable":true},"inbound_nodes":[[["dropout_Dropout60",0,0,{}]]]},{"name":"activation_Activation12","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation12","trainable":true},"inbound_nodes":[[["dense_Dense48",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization67_input",0,0]],"output_layers":[["activation_Activation12",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization67/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization67/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/forward_lstm_LSTM23/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/forward_lstm_LSTM23/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/forward_lstm_LSTM23/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/backward_lstm_LSTM23/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/backward_lstm_LSTM23/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional23/backward_lstm_LSTM23/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization68/gamma","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization68/beta","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/forward_lstm_LSTM24/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/forward_lstm_LSTM24/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/forward_lstm_LSTM24/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/backward_lstm_LSTM24/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/backward_lstm_LSTM24/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional24/backward_lstm_LSTM24/bias","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization69/gamma","shape":[48],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization69/beta","shape":[48],"dtype":"float32"},{"name":"dense_Dense45/kernel","shape":[48,64],"dtype":"float32"},{"name":"dense_Dense45/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization70/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization70/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense46/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense46/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization71/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization71/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense47/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense47/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization72/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization72/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense48/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense48/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}