{"modelTopology":{"class_name":"Model","config":{"name":"sequential_20_model","layers":[{"name":"layer_normalization_LayerNormalization115_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization115_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization115","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization115","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization115_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional39","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM39","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional39","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization115",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization116","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization116","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional39",0,0,{}]]]},{"name":"dropout_Dropout96","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout96","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization116",0,0,{}]]]},{"name":"bidirectional_Bidirectional40","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM40","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional40","trainable":true},"inbound_nodes":[[["dropout_Dropout96",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization117","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization117","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional40",0,0,{}]]]},{"name":"dropout_Dropout97","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout97","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization117",0,0,{}]]]},{"name":"dense_Dense77","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense77","trainable":true},"inbound_nodes":[[["dropout_Dropout97",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization118","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization118","trainable":true},"inbound_nodes":[[["dense_Dense77",0,0,{}]]]},{"name":"dropout_Dropout98","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout98","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization118",0,0,{}]]]},{"name":"dense_Dense78","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense78","trainable":true},"inbound_nodes":[[["dropout_Dropout98",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization119","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization119","trainable":true},"inbound_nodes":[[["dense_Dense78",0,0,{}]]]},{"name":"dropout_Dropout99","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout99","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization119",0,0,{}]]]},{"name":"dense_Dense79","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense79","trainable":true},"inbound_nodes":[[["dropout_Dropout99",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization120","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization120","trainable":true},"inbound_nodes":[[["dense_Dense79",0,0,{}]]]},{"name":"dropout_Dropout100","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout100","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization120",0,0,{}]]]},{"name":"dense_Dense80","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense80","trainable":true},"inbound_nodes":[[["dropout_Dropout100",0,0,{}]]]},{"name":"activation_Activation20","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation20","trainable":true},"inbound_nodes":[[["dense_Dense80",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization115_input",0,0]],"output_layers":[["activation_Activation20",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization115/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization115/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/forward_lstm_LSTM39/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/forward_lstm_LSTM39/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/forward_lstm_LSTM39/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/backward_lstm_LSTM39/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/backward_lstm_LSTM39/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional39/backward_lstm_LSTM39/bias","shape":[512],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization116/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization116/beta","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/forward_lstm_LSTM40/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/forward_lstm_LSTM40/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/forward_lstm_LSTM40/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/backward_lstm_LSTM40/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/backward_lstm_LSTM40/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional40/backward_lstm_LSTM40/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization117/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization117/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense77/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense77/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization118/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization118/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense78/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense78/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization119/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization119/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense79/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense79/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization120/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization120/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense80/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense80/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}