{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM3","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional3","trainable":true,"batch_input_shape":[null,20,16],"dtype":"float32"}},{"class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization3","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM4","trainable":true,"units":48,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.00005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional4","trainable":true}},{"class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization4","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000025}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense6","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/kernel","shape":[16,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/kernel","shape":[16,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/gamma","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/beta","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/forward_lstm_LSTM4/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/forward_lstm_LSTM4/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/forward_lstm_LSTM4/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/backward_lstm_LSTM4/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/backward_lstm_LSTM4/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional4/backward_lstm_LSTM4/bias","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/gamma","shape":[96],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/beta","shape":[96],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[96,16],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}