{"modelTopology":{"class_name":"Model","config":{"name":"sequential_14_model","layers":[{"name":"layer_normalization_LayerNormalization79_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization79_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization79","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization79","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization79_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional27","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM27","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional27","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization79",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization80","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization80","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional27",0,0,{}]]]},{"name":"dropout_Dropout66","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout66","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization80",0,0,{}]]]},{"name":"bidirectional_Bidirectional28","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM28","trainable":true,"units":48,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional28","trainable":true},"inbound_nodes":[[["dropout_Dropout66",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization81","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization81","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional28",0,0,{}]]]},{"name":"dropout_Dropout67","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout67","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization81",0,0,{}]]]},{"name":"dense_Dense53","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense53","trainable":true},"inbound_nodes":[[["dropout_Dropout67",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization82","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization82","trainable":true},"inbound_nodes":[[["dense_Dense53",0,0,{}]]]},{"name":"dropout_Dropout68","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout68","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization82",0,0,{}]]]},{"name":"dense_Dense54","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense54","trainable":true},"inbound_nodes":[[["dropout_Dropout68",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization83","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization83","trainable":true},"inbound_nodes":[[["dense_Dense54",0,0,{}]]]},{"name":"dropout_Dropout69","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout69","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization83",0,0,{}]]]},{"name":"dense_Dense55","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense55","trainable":true},"inbound_nodes":[[["dropout_Dropout69",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization84","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization84","trainable":true},"inbound_nodes":[[["dense_Dense55",0,0,{}]]]},{"name":"dropout_Dropout70","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout70","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization84",0,0,{}]]]},{"name":"dense_Dense56","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense56","trainable":true},"inbound_nodes":[[["dropout_Dropout70",0,0,{}]]]},{"name":"activation_Activation14","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation14","trainable":true},"inbound_nodes":[[["dense_Dense56",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization79_input",0,0]],"output_layers":[["activation_Activation14",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization79/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization79/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/forward_lstm_LSTM27/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/forward_lstm_LSTM27/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/forward_lstm_LSTM27/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/backward_lstm_LSTM27/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/backward_lstm_LSTM27/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional27/backward_lstm_LSTM27/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization80/gamma","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization80/beta","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/forward_lstm_LSTM28/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/forward_lstm_LSTM28/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/forward_lstm_LSTM28/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/backward_lstm_LSTM28/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/backward_lstm_LSTM28/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional28/backward_lstm_LSTM28/bias","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization81/gamma","shape":[48],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization81/beta","shape":[48],"dtype":"float32"},{"name":"dense_Dense53/kernel","shape":[48,64],"dtype":"float32"},{"name":"dense_Dense53/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization82/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization82/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense54/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense54/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization83/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization83/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense55/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense55/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization84/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization84/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense56/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense56/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}