{"modelTopology":{"class_name":"Model","config":{"name":"sequential_32_model","layers":[{"name":"layer_normalization_LayerNormalization187_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization187_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization187","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization187","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization187_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional63","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM63","trainable":true,"units":192,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional63","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization187",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization188","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization188","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional63",0,0,{}]]]},{"name":"dropout_Dropout156","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout156","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization188",0,0,{}]]]},{"name":"bidirectional_Bidirectional64","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM64","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional64","trainable":true},"inbound_nodes":[[["dropout_Dropout156",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization189","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization189","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional64",0,0,{}]]]},{"name":"dropout_Dropout157","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout157","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization189",0,0,{}]]]},{"name":"dense_Dense125","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense125","trainable":true},"inbound_nodes":[[["dropout_Dropout157",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization190","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization190","trainable":true},"inbound_nodes":[[["dense_Dense125",0,0,{}]]]},{"name":"dropout_Dropout158","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout158","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization190",0,0,{}]]]},{"name":"dense_Dense126","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense126","trainable":true},"inbound_nodes":[[["dropout_Dropout158",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization191","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization191","trainable":true},"inbound_nodes":[[["dense_Dense126",0,0,{}]]]},{"name":"dropout_Dropout159","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout159","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization191",0,0,{}]]]},{"name":"dense_Dense127","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense127","trainable":true},"inbound_nodes":[[["dropout_Dropout159",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization192","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization192","trainable":true},"inbound_nodes":[[["dense_Dense127",0,0,{}]]]},{"name":"dropout_Dropout160","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout160","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization192",0,0,{}]]]},{"name":"dense_Dense128","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense128","trainable":true},"inbound_nodes":[[["dropout_Dropout160",0,0,{}]]]},{"name":"activation_Activation32","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation32","trainable":true},"inbound_nodes":[[["dense_Dense128",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization187_input",0,0]],"output_layers":[["activation_Activation32",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization187/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization187/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/forward_lstm_LSTM63/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/forward_lstm_LSTM63/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/forward_lstm_LSTM63/bias","shape":[768],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/backward_lstm_LSTM63/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/backward_lstm_LSTM63/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional63/backward_lstm_LSTM63/bias","shape":[768],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization188/gamma","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization188/beta","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/forward_lstm_LSTM64/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/forward_lstm_LSTM64/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/forward_lstm_LSTM64/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/backward_lstm_LSTM64/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/backward_lstm_LSTM64/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional64/backward_lstm_LSTM64/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization189/gamma","shape":[96],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization189/beta","shape":[96],"dtype":"float32"},{"name":"dense_Dense125/kernel","shape":[96,64],"dtype":"float32"},{"name":"dense_Dense125/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization190/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization190/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense126/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense126/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization191/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization191/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense127/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense127/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization192/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization192/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense128/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense128/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}