{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_17","layers":[{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM33","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional33","trainable":true,"batch_input_shape":[null,20,16],"dtype":"float32"}},{"class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization33","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout33","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM34","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000005}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000005}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional34","trainable":true}},{"class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization34","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout34","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0000025}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_Dense50","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense51","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bidirectional_Bidirectional33/forward_lstm_LSTM33/kernel","shape":[16,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional33/forward_lstm_LSTM33/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional33/forward_lstm_LSTM33/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional_Bidirectional33/backward_lstm_LSTM33/kernel","shape":[16,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional33/backward_lstm_LSTM33/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional33/backward_lstm_LSTM33/bias","shape":[512],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization33/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization33/beta","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/forward_lstm_LSTM34/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/forward_lstm_LSTM34/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/forward_lstm_LSTM34/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/backward_lstm_LSTM34/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/backward_lstm_LSTM34/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional34/backward_lstm_LSTM34/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization34/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization34/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense50/kernel","shape":[128,16],"dtype":"float32"},{"name":"dense_Dense50/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense51/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense51/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}