{"modelTopology":{"class_name":"Model","config":{"name":"sequential_19_model","layers":[{"name":"layer_normalization_LayerNormalization109_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization109_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization109","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization109","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization109_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional37","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM37","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional37","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization109",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization110","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization110","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional37",0,0,{}]]]},{"name":"dropout_Dropout91","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout91","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization110",0,0,{}]]]},{"name":"bidirectional_Bidirectional38","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM38","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional38","trainable":true},"inbound_nodes":[[["dropout_Dropout91",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization111","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization111","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional38",0,0,{}]]]},{"name":"dropout_Dropout92","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout92","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization111",0,0,{}]]]},{"name":"dense_Dense73","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense73","trainable":true},"inbound_nodes":[[["dropout_Dropout92",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization112","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization112","trainable":true},"inbound_nodes":[[["dense_Dense73",0,0,{}]]]},{"name":"dropout_Dropout93","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout93","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization112",0,0,{}]]]},{"name":"dense_Dense74","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense74","trainable":true},"inbound_nodes":[[["dropout_Dropout93",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization113","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization113","trainable":true},"inbound_nodes":[[["dense_Dense74",0,0,{}]]]},{"name":"dropout_Dropout94","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout94","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization113",0,0,{}]]]},{"name":"dense_Dense75","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense75","trainable":true},"inbound_nodes":[[["dropout_Dropout94",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization114","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization114","trainable":true},"inbound_nodes":[[["dense_Dense75",0,0,{}]]]},{"name":"dropout_Dropout95","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout95","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization114",0,0,{}]]]},{"name":"dense_Dense76","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense76","trainable":true},"inbound_nodes":[[["dropout_Dropout95",0,0,{}]]]},{"name":"activation_Activation19","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation19","trainable":true},"inbound_nodes":[[["dense_Dense76",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization109_input",0,0]],"output_layers":[["activation_Activation19",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization109/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization109/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/forward_lstm_LSTM37/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/forward_lstm_LSTM37/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/forward_lstm_LSTM37/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/backward_lstm_LSTM37/kernel","shape":[22,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/backward_lstm_LSTM37/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional37/backward_lstm_LSTM37/bias","shape":[512],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization110/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization110/beta","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/forward_lstm_LSTM38/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/forward_lstm_LSTM38/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/forward_lstm_LSTM38/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/backward_lstm_LSTM38/kernel","shape":[256,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/backward_lstm_LSTM38/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional38/backward_lstm_LSTM38/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization111/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization111/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense73/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense73/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization112/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization112/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense74/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense74/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization113/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization113/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense75/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense75/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization114/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization114/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense76/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense76/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}