{"modelTopology":{"class_name":"Model","config":{"name":"sequential_18_model","layers":[{"name":"layer_normalization_LayerNormalization103_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization103_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization103","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization103","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization103_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional35","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM35","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional35","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization103",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization104","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization104","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional35",0,0,{}]]]},{"name":"dropout_Dropout86","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout86","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization104",0,0,{}]]]},{"name":"bidirectional_Bidirectional36","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM36","trainable":true,"units":48,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional36","trainable":true},"inbound_nodes":[[["dropout_Dropout86",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization105","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization105","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional36",0,0,{}]]]},{"name":"dropout_Dropout87","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout87","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization105",0,0,{}]]]},{"name":"dense_Dense69","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense69","trainable":true},"inbound_nodes":[[["dropout_Dropout87",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization106","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization106","trainable":true},"inbound_nodes":[[["dense_Dense69",0,0,{}]]]},{"name":"dropout_Dropout88","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout88","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization106",0,0,{}]]]},{"name":"dense_Dense70","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense70","trainable":true},"inbound_nodes":[[["dropout_Dropout88",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization107","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization107","trainable":true},"inbound_nodes":[[["dense_Dense70",0,0,{}]]]},{"name":"dropout_Dropout89","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout89","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization107",0,0,{}]]]},{"name":"dense_Dense71","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense71","trainable":true},"inbound_nodes":[[["dropout_Dropout89",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization108","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization108","trainable":true},"inbound_nodes":[[["dense_Dense71",0,0,{}]]]},{"name":"dropout_Dropout90","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout90","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization108",0,0,{}]]]},{"name":"dense_Dense72","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense72","trainable":true},"inbound_nodes":[[["dropout_Dropout90",0,0,{}]]]},{"name":"activation_Activation18","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation18","trainable":true},"inbound_nodes":[[["dense_Dense72",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization103_input",0,0]],"output_layers":[["activation_Activation18",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization103/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization103/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/forward_lstm_LSTM35/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/forward_lstm_LSTM35/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/forward_lstm_LSTM35/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/backward_lstm_LSTM35/kernel","shape":[22,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/backward_lstm_LSTM35/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional35/backward_lstm_LSTM35/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization104/gamma","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization104/beta","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/forward_lstm_LSTM36/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/forward_lstm_LSTM36/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/forward_lstm_LSTM36/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/backward_lstm_LSTM36/kernel","shape":[192,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/backward_lstm_LSTM36/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional36/backward_lstm_LSTM36/bias","shape":[192],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization105/gamma","shape":[48],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization105/beta","shape":[48],"dtype":"float32"},{"name":"dense_Dense69/kernel","shape":[48,64],"dtype":"float32"},{"name":"dense_Dense69/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization106/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization106/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense70/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense70/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization107/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization107/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense71/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense71/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization108/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization108/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense72/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense72/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}