{"modelTopology":{"class_name":"Model","config":{"name":"sequential_29_model","layers":[{"name":"layer_normalization_LayerNormalization169_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization169_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization169","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization169","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization169_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional57","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM57","trainable":true,"units":192,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional57","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization169",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization170","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization170","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional57",0,0,{}]]]},{"name":"dropout_Dropout141","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout141","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization170",0,0,{}]]]},{"name":"bidirectional_Bidirectional58","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM58","trainable":true,"units":96,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional58","trainable":true},"inbound_nodes":[[["dropout_Dropout141",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization171","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization171","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional58",0,0,{}]]]},{"name":"dropout_Dropout142","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout142","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization171",0,0,{}]]]},{"name":"dense_Dense113","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense113","trainable":true},"inbound_nodes":[[["dropout_Dropout142",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization172","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization172","trainable":true},"inbound_nodes":[[["dense_Dense113",0,0,{}]]]},{"name":"dropout_Dropout143","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout143","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization172",0,0,{}]]]},{"name":"dense_Dense114","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense114","trainable":true},"inbound_nodes":[[["dropout_Dropout143",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization173","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization173","trainable":true},"inbound_nodes":[[["dense_Dense114",0,0,{}]]]},{"name":"dropout_Dropout144","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout144","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization173",0,0,{}]]]},{"name":"dense_Dense115","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense115","trainable":true},"inbound_nodes":[[["dropout_Dropout144",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization174","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization174","trainable":true},"inbound_nodes":[[["dense_Dense115",0,0,{}]]]},{"name":"dropout_Dropout145","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout145","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization174",0,0,{}]]]},{"name":"dense_Dense116","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense116","trainable":true},"inbound_nodes":[[["dropout_Dropout145",0,0,{}]]]},{"name":"activation_Activation29","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation29","trainable":true},"inbound_nodes":[[["dense_Dense116",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization169_input",0,0]],"output_layers":[["activation_Activation29",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization169/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization169/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/forward_lstm_LSTM57/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/forward_lstm_LSTM57/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/forward_lstm_LSTM57/bias","shape":[768],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/backward_lstm_LSTM57/kernel","shape":[22,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/backward_lstm_LSTM57/recurrent_kernel","shape":[192,768],"dtype":"float32"},{"name":"bidirectional_Bidirectional57/backward_lstm_LSTM57/bias","shape":[768],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization170/gamma","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization170/beta","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/forward_lstm_LSTM58/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/forward_lstm_LSTM58/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/forward_lstm_LSTM58/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/backward_lstm_LSTM58/kernel","shape":[384,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/backward_lstm_LSTM58/recurrent_kernel","shape":[96,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional58/backward_lstm_LSTM58/bias","shape":[384],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization171/gamma","shape":[96],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization171/beta","shape":[96],"dtype":"float32"},{"name":"dense_Dense113/kernel","shape":[96,64],"dtype":"float32"},{"name":"dense_Dense113/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization172/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization172/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense114/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense114/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization173/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization173/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense115/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense115/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization174/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization174/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense116/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense116/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}