{"modelTopology":{"class_name":"Model","config":{"name":"sequential_7_model","layers":[{"name":"layer_normalization_LayerNormalization37_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization37_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization37","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization37","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization37_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional13","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM13","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional13","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization37",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization38","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization38","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional13",0,0,{}]]]},{"name":"dropout_Dropout31","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout31","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization38",0,0,{}]]]},{"name":"bidirectional_Bidirectional14","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM14","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional14","trainable":true},"inbound_nodes":[[["dropout_Dropout31",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization39","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization39","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional14",0,0,{}]]]},{"name":"dropout_Dropout32","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout32","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization39",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["dropout_Dropout32",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization40","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization40","trainable":true},"inbound_nodes":[[["dense_Dense25",0,0,{}]]]},{"name":"dropout_Dropout33","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout33","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization40",0,0,{}]]]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["dropout_Dropout33",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization41","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization41","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}]]]},{"name":"dropout_Dropout34","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout34","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization41",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["dropout_Dropout34",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization42","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization42","trainable":true},"inbound_nodes":[[["dense_Dense27",0,0,{}]]]},{"name":"dropout_Dropout35","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout35","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization42",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["dropout_Dropout35",0,0,{}]]]},{"name":"activation_Activation7","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation7","trainable":true},"inbound_nodes":[[["dense_Dense28",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization37_input",0,0]],"output_layers":[["activation_Activation7",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization37/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization37/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/forward_lstm_LSTM13/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/forward_lstm_LSTM13/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/forward_lstm_LSTM13/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/backward_lstm_LSTM13/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/backward_lstm_LSTM13/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional13/backward_lstm_LSTM13/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization38/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization38/beta","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/forward_lstm_LSTM14/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/forward_lstm_LSTM14/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/forward_lstm_LSTM14/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/backward_lstm_LSTM14/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/backward_lstm_LSTM14/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional14/backward_lstm_LSTM14/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization39/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization39/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[32,64],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization40/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization40/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization41/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization41/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization42/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization42/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}