{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1_model","layers":[{"name":"layer_normalization_LayerNormalization1_input","class_name":"InputLayer","config":{"batch_input_shape":[null,30,22],"dtype":"float32","sparse":false,"name":"layer_normalization_LayerNormalization1_input"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization1","trainable":true,"batch_input_shape":[null,30,22],"dtype":"float32"},"inbound_nodes":[[["layer_normalization_LayerNormalization1_input",0,0,{}]]]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization1",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization2","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization2",0,0,{}]]]},{"name":"bidirectional_Bidirectional2","class_name":"Bidirectional","config":{"merge_mode":"ave","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization3","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization3","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional2",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization3",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization4","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization4","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization4",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization5","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization5","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":2,"axis":0}},"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization6","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization6","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MinMaxNorm","config":{"min_value":-0.5,"max_value":0.5,"rate":1,"axis":0}},"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["dropout_Dropout5",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]}],"input_layers":[["layer_normalization_LayerNormalization1_input",0,0]],"output_layers":[["activation_Activation1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"layer_normalization_LayerNormalization1/gamma","shape":[22],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/beta","shape":[22],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel","shape":[22,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/beta","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[32,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/gamma","shape":[32],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/gamma","shape":[16],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}